student_id = ""
F_name = ""
i_name = ""
m_name = ""
hw_list = list()
pa_list = list()
list_visit = list()



#TODO: Запрашиваем ID студента
#TODO: Запрашиваем ФИО студента
# ФИО должно начинаться с большой буквы - title применить6
# проверить чтобы фио не содержало цифры и пробелы



#TODO: Создать меню - While True
#TODO: Пункты меню
# 1. Show studemt data
#Student ID: <student_id>
# Full name: <I_name> <f_name> <m_name>
# Homeworks:
# 1. 12
#2. 12
#3. -
#4. -
#5. 12
 # <position>. <grade_or_absent>
 #TODO: 2. Show students stats
 # ЛЗ и ПЗ у которых "-" не участвуют в вычеслений средней
 #ФИО;
# общая средняя оценка по всем выполненным ДЗ и ПЗ; ДЗ и ПЗ укоторых "-" не участ
# - #средняя оценка за ПЗ;
# - #количество выполненных ПЗ и общее количество ПЗ;
# - #процент выполненных ПЗ;
# - #средняя оценка за ДЗ;
# - к#оличество выполненных ДЗ и общее количество ДЗ;
# -# процент выполненных ДЗ;
# - #количество посещённых занятий и общее количество занятий;
# - п#роцент посещений.
# TODO: 3. Change full name
# Запроситть что конкретно хочет изменить: 1, 2, 3
# Запросить фамилию
# Заппосить имя - ппроверяем точно также, как рнаверху.
# Запросить отчество.
# TODO: 4. add HW
# Условимся, что "-" означает, которое не оценено.
# hw_list.append("-")



#TODO: 5.Grade HW
#Запросить номер задания, которыцй в hw_list
#ПРоверить задание - на границы (допустимые от 1 до len(hw_list))
# Если номер в порядке, запросить оценку
#Проверить оцунку натграницу (допустимые числа от 1 до 5)

#TODO: 10. Add Visit
#Показать подменю с пунктами 1и 2, где 1 - present, 2 - absent
# Запрашиваем выбор пункте добавляем в list_visit present  или absent
#TODO: 11. Change visit
# Запрашиваем день посещения который лежит в list_visit
# ппроверяме ноиер на границу (допустимые от 1 до len(list_visit)
#Усли номер посещения в порядке, то показать подменю пунктами 1 и 2, где 1
#Запрашиваем выбор пункта
# в любом верном пункте пункте по указаному индексу (позиция - 1)
#TODO 12:

